netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_getCustomizationId_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
   <soapenv:Header>
      <urn:preferences>
         <urn:warningAsError></urn:warningAsError>
         <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
         <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
         <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
      </urn:preferences>
      <urn:partnerInfo>
         <urn:partnerId></urn:partnerId>
      </urn:partnerInfo>
      <urn:applicationInfo>
         <urn:applicationId></urn:applicationId>
      </urn:applicationInfo>
      <urn:passport>
         <urn:email>%s(email)</urn:email>
         <urn:password>%s(password)</urn:password>
         <urn:account>%s(account)</urn:account>
         <urn1:role>
            <urn1:name></urn1:name>
         </urn1:role>
      </urn:passport>
   </soapenv:Header>
   <soapenv:Body>
      <getCustomizationId xmlns="urn:messages_2014_1.platform.webservices.netsuite.com">
            <customizationType getCustomizationType="customRecordType" />
            <includeInactives>false</includeInactives>
      </getCustomizationId>
   </soapenv:Body>
</soapenv:Envelope>